app/controllers/restaurant_pizzas_controller.rb

  def index
    @restaurant_pizzas = RestaurantPizza.all
---
SELECT "restaurant_pizzas".* FROM "restaurant_pizzas"