app/controllers/restaurants_controller.rb

    def show
      @restaurant = Restaurant.find_by(id: params[:id])
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]